; TaskSwitchXP Pro 2.05 English Language File (Template)
; Translated by Alexander Avdonin <alexander@ntwind.com>

;##############################################################################
; Changes for version 2.06 (May 16, 2005)
; Added strings:
;   => 20111="Add minimized to tray windows to the end of Alt-Tab list"
;##############################################################################


;##############################################################################
; TaskSwitchXP enumerates all *.LNG files into .\lang subfolder!
; To add a language for TaskSwitchXP:
;     1) translate this file;
;     2) save it as <NewLanguage>.lng in UNICODE format
;        (for Notepad: select File->Save_As and then choose Unicode encoding);
;     3) test it before submitting!!!
;
; Translations forum/tracker: http://www.ntwind.com/forum/viewforum.php?f=3
;
; I will include some translations to my official release (if you accept!)...
; Please put your e-mail address for feedback somewhere!


; There are a few special characters (two symbols are recognized as one):
;     1) carriage return and new line:  \r\n
;     2) tab:  \t
;     3) quotation mark:  \"
;     4) back slash:  \\


; NOTE: These language files will generally work with future versions of 
;       TaskSwitchXP, but some strings will appear in English. I will put a 
;       change log for future versions in the comments of this file.
;##############################################################################


; Currently TaskSwitchXP uses *.LNG file names for language identifying.
; This string is ignored. Please put here for future versions:
;     19999="English_LanguageName (Native_LanguageName)"
;     e.g. 19999="German (Deutsch)"
19999="Brazilian Portuguese (Português)"


; Cofiguration
20000="Configurações do TaskSwitchXP Pro 2.0"
20001="&OK"
20002="&Cancelar"
20003="&Aplicar"

; Filters
20031="Arquivos de Configuração (*.cfg)"


; Pages
20050="Geral"
20051="Aparência"
20052="Lista de Tarefas"
20053="Pré-Visualização"
20054="Detalhes da Tarefa"
20055="Teclas de Acesso"
20056="Exclusões"
20057="Avançado"
20058="Sobre"

; Page descriptions
20070="Configurações Gerais"
20071="Configurações Visuais"
20072="Lista de Tarefas"
20073="Configurações de Pré-Visualização"
20074="Detalhes da Tarefa"
20075="Teclas de Acesso do TaskSwitchXP"
20076="Exclusões do TaskSwitchXP"
20077="Configurações Avançadas"
20078="Sobre o TaskSwitchXP"


; General page
20100="Idioma:"
20101="<a id=\"idLang\" href=\"\">Encontrar mais traduções...</a>"
20102="Usar configurações separadas para cada usuário"
20103="Iniciar o TaskSwitchXP junto com o Windows"
20104="Definir prioridade alta de execução para o TaskSwitchXP"
20105="Verificar se o Ms PowerToy TaskSwitcher está executando"
20106="Ícone da bandeja:"
20107="Exibir o ícone do TaskSwitchXP na bandeja"
20108="Usar ícone personalizado:"
20109="Minimizar janelas na bandeja clicando o botão direito em Minimizar"
20110="Não ocultar ícone do TaskSwitchXP da bandeja"
20111="Colocar no fim da lista janelas que foram minimizadas na bandeja"

20120="&Restaurar padrões"
20121="A&brir..."
20122="&Salvar..."

; Appearance page
20200="Posição na tela:"
20201="Exibir no monitor ativo"
20202="Sombra na janela do TaskSwitchXP"
20203="Ativar transparência na janela do TaskSwitchXP:"
20204="Ativar esmaecimento na abertura (em milisegundos):"
20205="Ativar esmaecimento no fechamento (em milisegundos):"
20206="Modos de desenho preferidos:"
20207="Estilo visual do XP:"
20208="Estilo clássico:"
20209="Forçar uso do estilo clássico do TaskSwitchXP"
20210="Ordernar painel da esquerda para a direita"

; Position on screen
20270="Superior - Esquerda"
20271="Superior - Centro"
20272="Superior - Direita"
20273="Centro - Esquerda"
20274="Centralizada"
20275="Centro - Direita"
20276="Inferior - Esquerda"
20277="Inferior - Centro"
20278="Inferior - Direita"

; Modern XP skins
20280="Estilo do Menu Iniciar (padrão)"
20281="Estilo PowerToy TaskSwitcher"
20282="Estilo de Janela Simples"
20283="Estilo Flat XP"
20284="Estilo Soft XP"
20285="Estilo Barra de Tarefas"

; Classical skins
20290="Estilo do Menu Iniciar (padrão)"
20291="Estilo plano do Menu Iniciar"


; Task List page
20300="Exibição da lista:"
20301="Número de colunas:"
20302="Largura (em pixels):"
20303="Número de linhas:"
20304="Ícones pequenos"
20305="Ativar tooltips para a lista de ícones"
20306="Ativar indicador de link para itens com seleção automática"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="Ativar seleção automática pelo mouse"
20308="Inverter rolagem do mouse"
20309="Estilo de seleção:"
20310="Desenhar retângulo de foco"
20311="Estilo e cores do texto:"
20312="Fonte:"
20313="Tamanho:"
20314="N"
20315="I"
20316="Cor para:"

; List views
20390="Ícones"
20391="Lista vertical"

; Selection styles
20380="Borda"
20381="Retângulo preenchido"
20382="Retângulo arredondado"

; Color indexes
20370="Texto simples"
20371="Texto selecionado"
20372="Fundo da seleção"
20373="Texto marcado 1"
20374="Fundo marcado 1"
20375="Texto marcado 2"
20376="Fundo marcado 2"


; Preview page
20400="Estilo da pré-visualização:"
20401="Estilo \"Área de Trabalho\""
20402="Estilo \"Janela\""
20403="Incluir barra de tarefas na imagem de pré-visualização"
20404="Desenhar apenas a última janela da aplicação aberta"
20405="Não desenhar a área de trabalho (estilo v1.0 antigo)"
20406="Desenhar papel de parede ao fundo"
20407="Desenhar borda ao redor da imagem de pré-visualização"
20408="Centralizar imagem de pré-visualização verticalmente"
20409="Exibir título das janelas minimizadas na imagem (*)"
20410="Excluir todas as janelas transparentes da imagem (*)"
20411="Largura da imagem de pré-visualização (em pixels):"
20412="Pausa na geração da primeira imagem (em milisegundos):"
20413="Não guardar imagens de pré-visualização em cache"
20414="Atualização automática da imagem (em milisegundos):"


; Info page
20500="Painel de título:"
20501="Fonte:"
20502="Tamanho:"
20503="N"
20504="I"
20505="Cor:"
20506="Desenhar sombra:"
20507="Distância:"
20508="Cor:"
20509="Exibir ícone da aplicação no painel de título"
20510="Usar painel de título pequeno"
20511="Painel de informações:"
20512="Fonte:"
20513="Tamanho:"
20514="N"
20515="I"
20516="Cor:"
20517="Desenhar sombra:"
20518="Distância:"
20519="Cor:" deep
20520="Altura:"
20521="Formato:"

; Info formats
20590="Nenhuma"
20591="Somente número da tarefa"
20592="ID do processo"
20593="Nome do processo"
20594="Nome do processo  [PID]"
20595="Descrição do Programa"


; Hotkeys page
20600="Substituir alternador de tarefas padrão de Alt-Tab do Windows"
20601="Ativar alternador de instâncias através de Ctrl+Alt+[Shift]+Tab"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Ativar modo \"pegajoso\" do Alt-Tab"
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="Usar baixo nível de captura de teclas para substituição do Alt-Tab"
20604="Controle do TaskSwitchXP:"
20605="Lista de aplicações:"
20606="Lista de instâncias:"
20607="Configurações do TaskSwitchXP:"
20608="Exibir/Ocultar ícone da bandeja:"
20609="Sair do TaskSwitchXP:"
20610="Teclas de acesso adicionais:"
20611="Minimizar para a bandeja:"
20612="Restaurar da bandeja:"


; Exclusions page
20700="&Nova..."
20701="&Editar..."
20702="&Remover"

; List groups
20780="Pré-visualização da imagem"
20781="Enumeração de janelas"

20790="Nome"
20791="Parâmetros"

; Advanced page
20800="Títulos das janelas:"
20801="Usar títulos da janela principal das aplicações"
20802="Configurações avançadas de interface:"
20803="Remover painel de título"
20804="Remover painel de informações"
20805="Ações do ícone da bandeja:"
20806="Menu de contexto:"
20807="Configuração:"
20808="Lista de aplicações:"
20809="Lista de instâncias:"
20810="Configurações do configurador:"
20811="Exibir janela de configuração sempre à frente"
20812="Guardar posição da janela de configuração"
20813="Guardar última página de configuração acessada"
20814="Iniciar o TaskSwitchXP no iniciar/fechar"

; Tray icon actions
20890="Nenhuma"
20891="Clicar com botão esquerdo"
20892="Duplo clique com botão esquerdo"
20893="Clicar com botão do meio"
20894="Duplo clique com botão do meio"
20895="Clicar com botão direito"
20896="Duplo clique com botão direito"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="Traduzido por <a id=\"idTranslatorMail\" href=\"Lang\">Poorlyte</a>\r\nSou um desocupado mesmo..."


; Exclusions dialog
22000="Exclusões do TaskSwitchXP"
22001="&OK"
22002="&Cancelar"
22003="Aplicações ativas:"
22004="&Atualizar"
22005="Nome da exclusão:"
22006="Excluído por:"
22007="Nome do processo:"
22008="Classe da janela:"
22009="Título da janela:"
22010="Excluído da:"
22011="Pré-visualização da imagem"
22012="Enumeração de janelas"
22013="Ativada"

22090="" ; not excluded
22091=">> excluído da pré-visualização"
22092=">> excluído da enumeração"

; Configurator Errors
30000="Erro do Configurador do TaskSwitchXP"
30002="Não foi possível iniciar o TaskSwitchXP (TaskSwitchXP.exe)! Verifique sua instalação do TaskSwitchXP."
30003="Não foi possível salvar as configurações no registro. Verifique seus direitos de acesso."
30004="Não foi possível carregar as configurações do arquivo."
30005="Não foi possível carregar as configurações do arquivo. A configuração padrão será restaurada."
30006="Não foi possível salbar as configurações no arquivo."

; Hints for exclusion dialog
30100="Exclusão não nomeada"
30101="Especifique o nome da exclusão."
30102="Sem parâmetros"
30103="Especifique o(s) parâmetro(s) da exclusão."
30104="Sem nome do processo"
30105="Especifique um nome de processo."
30106="Sem classe da janela"
30107="Especifique uma classe de janela."

; Confirmations
30900="Confirmação do TaskSwitchXP"
30901="TaskSwitchXP detectou que mais de um monitor está ativo no seu computador.\r\nGostaria de ativar o estilo \"Janela\" para exibir todas as pré-visualizações de monitor(es) secundário(s)?"


; TaskSwitchXP Language Strings

; Tray menu
31000="Lista de aplicações"
31001="Lista de instâncias"	
31002="Preferências..."
31003="Sair"

31020="Preferências rápidas"
31021="Ocultar ícone da bandeja"
31022="Substituir Alt-Tab"
31023="Ativar alternador de instâncias"
31024="Ativar modo \"pegajoso\" do Alt-Tab"
31025="Usar baixo nível de captura de teclas"
31026="Nova exclusão..."

31050="Ajuda"
31051="Documentação"
31052="Home Page"
31053="Sobre o TaskSwitchXP"

; Tray menu for minimized applications
31090="TSXP: %d programa(s)"
31091="Restaurar Tudo"
31092="Minimizar Tudo"
31093="Fechar Tudo"
31094="Restaurar"
31095="Minimizar"
31096="Fechar"

; Task List menu
31110="Alternar Para"
31111="Minimizar"
31112="Minimizar para a bandeja"
31113="Cascata"
31114="Arranjar Horizontalmente"
31115="Arranjar Verticalmente"
31116="Restaurar"
31117="Maximizar"
31118="Fechar"
31119="Finalizar Processo"
    
; Common menu
31150="Exibir Detalhes do Processo"
31151="Selecionar Tudo"
31152="Sem Seleção"
31153="Remover Selecionado"
31154="Ordenar pelo Título"
31155="Ordenar por Aplicação"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="Nome da Imagem:  %s\r\nID do Processo:  %u\r\n\r\nDuração:  %u:%02u:%02u\r\nTempo de CPU:  %u:%02u:%02u\r\n\r\nUso de Memória:  %uK\r\nTamanho da Memória Virtual:  %uK"
31501="N/D" ; Process information is not available...

; Confirmations
31900="Confirmação do TaskSwitchXP"
31901="TaskSwitchXP já está em execução. Deseja interrompê-lo?"
31902="Você tem certeza que gostaria de sair do TaskSwitchXP?"
31903="TaskSwitchXP detectou que o Ms PowerToy TaskSwitcher está em execução.\r\nGostaria de encerrá-lo?"

; Errors
32000="Erro do TaskSwitchXP"
32002="Inicialização falhou."
32003="Não foi possível instalar a captura de teclas de baixo nível."
32004="Não foi possível registrar a tecla de acesso Alt+Tab ou Alt+Shift+Tab.\r\nOutra aplicação pode estar usando a mesma tecla de acesso."
32005="Não foi possível registrar a tecla de acesso Ctrl+Alt+Tab ou Ctrl+Alt+Shift+Tab.\r\nOutra aplicação pode estar usando a mesma tecla de acesso."
32006="Não foi possível iniciar o Configurador do TaskSwitchXP (ConfigTsXP.exe)! Verifique a instalação do TaskSwitchXP."

32500="Não foi possível registrar a tecla de acesso:\r\n\r\nNome: %s\r\nModificador: %02X\r\nCódigo Virtual: %02X"
32501="Sair do TaskSwitchXP"
32502="Exibir/Ocultar ícone da bandeja"
32503="Configurar o TaskSwitchXP"
32504="Lista de aplicações"
32505="Lista de intâncias"
32506="Minimizar janela para a bandeja"
32507="Restaurar da bandeja"
